In [37]:
import pandas as pd

In [38]:
x=(1,2,3,4,5)
b=pd.Series(x, index={'a','b','c', 'd','e'}, dtype="float", name="python")
print(b)
print(type(b))
print(b[2])

c    1.0
e    2.0
b    3.0
a    4.0
d    5.0
Name: python, dtype: float64
<class 'pandas.core.series.Series'>
3.0

C:\Users\Manasa\AppData\Local\Temp\ipykernel_6236\3233856276.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(b[2])

In [39]:
dic={"name":["python","java","c","c++"],"rank":[3,4,7,1],"use":[2,5,3,1]}
a=pd.Series(dic,name="python")
a

name    [python, java, c, c++]
rank              [3, 4, 7, 1]
use               [2, 5, 3, 1]
Name: python, dtype: object

In [40]:
s1=pd.Series(12,index=[1,2,3,4,5,6])
s2=pd.Series(12,index=[1,2,3,4])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
dtype: float64

In [2]:
import pandas as pd

b=[10,23,43,65,80]
a=pd.DataFrame(b)
print(type(a))

<class 'pandas.core.frame.DataFrame'>

C:\Users\Manasa\AppData\Local\Temp\ipykernel_4248\4005994827.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [42]:
dic={"a":[1,2,3,4,5],"b":[12,14,16,17,18], "d":[20,40,50,30,60]}
var = pd.DataFrame(dic, columns=["d"], index=["a","b","c","d","e"])
print(type(var))
var

<class 'pandas.core.frame.DataFrame'>

    d
a  20
b  40
c  50
d  30
e  60

In [43]:
dic={"a":[1,2,3,4,5],"b":[12,14,16,17,18], "d":[20,40,50,30,60]}
var2=pd.DataFrame(dic)
print(var2["d"][4])

60

In [4]:
list_a=[[12,32,43,56,71],[80,90,70,60,50]]
var3=pd.DataFrame(list_a)
print(type(var3))

<class 'pandas.core.frame.DataFrame'>

In [45]:
s={"a":pd.Series([1,2,3,4]),"b":pd.Series([10,12,13,14])}
var4=pd.DataFrame(s)
print(var4)

   a   b
0  1  10
1  2  12
2  3  13
3  4  14

In [46]:
var = pd.DataFrame({"a":[12,15,17,19,10], "b":[80,90,70,50,20]})
var["c"]=var["a"]*var["b"]
var

    a   b     c
0  12  80   960
1  15  90  1350
2  17  70  1190
3  19  50   950
4  10  20   200

In [47]:
var["python"]=var["a"]<=10                      
# logical operations
var

    a   b     c  python
0  12  80   960   False
1  15  90  1350   False
2  17  70  1190   False
3  19  50   950   False
4  10  20   200    True

In [48]:
var1=pd.DataFrame({"a":[12,32,57,83,98],"b":[19,86,40,83,20], "c":[30,40,50,60,70]})
var1

    a   b   c
0  12  19  30
1  32  86  40
2  57  40  50
3  83  83  60
4  98  20  70

In [49]:
var1["add"]=var1["a"]+var1["b"]
var1

    a   b   c  add
0  12  19  30   31
1  32  86  40  118
2  57  40  50   97
3  83  83  60  166
4  98  20  70  118

In [50]:
var1.insert(1,"python_insert_1",var1["b"])
var1

    a  python_insert_1   b   c  add
0  12               19  19  30   31
1  32               86  86  40  118
2  57               40  40  50   97
3  83               83  83  60  166
4  98               20  20  70  118

In [51]:
var1.insert(2,"insert_1",[10,20,30,40,50])
var1

    a  python_insert_1  insert_1   b   c  add
0  12               19        10  19  30   31
1  32               86        20  86  40  118
2  57               40        30  40  50   97
3  83               83        40  83  60  166
4  98               20        50  20  70  118

In [52]:
var1["python"]=var1["a"][:3]
var1

    a  python_insert_1  insert_1   b   c  add  python
0  12               19        10  19  30   31    12.0
1  32               86        20  86  40  118    32.0
2  57               40        30  40  50   97    57.0
3  83               83        40  83  60  166     NaN
4  98               20        50  20  70  118     NaN

In [53]:
var1.pop("c")
var1

    a  python_insert_1  insert_1   b  add  python
0  12               19        10  19   31    12.0
1  32               86        20  86  118    32.0
2  57               40        30  40   97    57.0
3  83               83        40  83  166     NaN
4  98               20        50  20  118     NaN

In [54]:
del var1["b"]

In [55]:
var1

    a  python_insert_1  insert_1  add  python
0  12               19        10   31    12.0
1  32               86        20  118    32.0
2  57               40        30   97    57.0
3  83               83        40  166     NaN
4  98               20        50  118     NaN

In [56]:
import pandas as pd

dic= ({"Name":['Manasa', 'Lalasa', 'Mounish', 'Pradnya', 'shrushti', 'kantha','srinivas'], "Age":[10,20,30,40,50,43,21], "Rank":[90,80,70,60,50,67,70],"Place":["Pune",'banglore',"kolkatha","Chennai","hydrabad","Delhi","Bombay"]})
var=pd.DataFrame(dic)
var

       Name  Age  Rank     Place
0    Manasa   10    90      Pune
1    Lalasa   20    80  banglore
2   Mounish   30    70  kolkatha
3   Pradnya   40    60   Chennai
4  shrushti   50    50  hydrabad
5    kantha   43    67     Delhi
6  srinivas   21    70    Bombay